app/views/contact_lists/_form.html.erb

		<div class="form-group col-sm-12">
			<%= f.collection_check_boxes(:user_ids, User.all, :id, :name) do |student| %>
---
SELECT "users".* FROM "users"