app/views/contact_lists/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "recipient_depositories" ON "users"."id" = "recipient_depositories"."user_id" WHERE "recipient_depositories"."contact_list_id" = ?  [["contact_list_id", 1]]
---
  </tr>
  <% @contact_list.users.each do |student| %>