app/views/users/index.html.erb

SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = ?  [["user_id", 1]]
---
        <td>
          <%= user.roles.map { |role| role.name }.join(', ') %>