app/controllers/contact_lists_controller.rb

SELECT "contact_lists".* FROM "contact_lists"
---
  def index
    @contact_lists = ContactList.paginate(page: params[:page], per_page: 10)

SELECT  "contact_lists".* FROM "contact_lists" WHERE "contact_lists"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @contact_list = ContactList.find(params[:id])

INSERT INTO "contact_lists" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "All"], ["created_at", "2015-12-26 08:28:46.454551"], ["updated_at", "2015-12-26 08:28:46.454551"]]
---
  def create
    @contact_list = ContactList.new(contact_list_params)
    if @contact_list.save

SELECT  "contact_lists".* FROM "contact_lists" WHERE "contact_lists"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @contact_list = ContactList.find(params[:id])

SELECT  "contact_lists".* FROM "contact_lists" WHERE "contact_lists"."id" = ? LIMIT 1  [["id", 2]]
---
  def update
    @contact_list = ContactList.find(params[:id])

SELECT  "contact_lists".* FROM "contact_lists" WHERE "contact_lists"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "contact_lists" WHERE "contact_lists"."id" = ?  [["id", 1]]
---
  def destroy
    @contact_list = ContactList.find(params[:id])
    @contact_list.destroy