app/controllers/course_elements_controller.rb

  def index
    @course_elements = CourseElement.all
---
SELECT "course_elements".* FROM "course_elements"

  def create
    @course_element = CourseElement.new(course_elements_params)

    if @course_element.save
---
INSERT INTO "course_elements" ("theme", "element_type", "date_for_theme", "date_for_hw", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["theme", "m"], ["element_type", "l"], ["date_for_theme", "2015-01-01"], ["date_for_hw", "2016-01-01"], ["created_at", "2015-12-16 10:06:03.152689"], ["updated_at", "2015-12-16 10:06:03.152689"]]

  def edit
    @course_element = CourseElement.find(params[:id])
---
SELECT  "course_elements".* FROM "course_elements" WHERE "course_elements"."id" = ? LIMIT 1  [["id", 2]]

  def update
    @course_element = CourseElement.find(params[:id])
---
SELECT  "course_elements".* FROM "course_elements" WHERE "course_elements"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    @course_element = CourseElement.find(params[:id])

    @course_element.destroy
---
SELECT  "course_elements".* FROM "course_elements" WHERE "course_elements"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "course_elements" WHERE "course_elements"."id" = ?  [["id", 1]]