app/controllers/senders_controller.rb

  def create
    @sender = Sender.new(sender_params)
    if @sender.save
---
INSERT INTO "senders" ("name", "sms_service_account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Jedi Order"], ["sms_service_account_id", 1], ["created_at", "2015-12-26 08:39:32.853655"], ["updated_at", "2015-12-26 08:39:32.853655"]]