app/controllers/sms_deliveries_controller.rb

SELECT  "sms_deliveries".* FROM "sms_deliveries"  ORDER BY "sms_deliveries"."created_at" DESC LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "sms_deliveries"
---
  def index
    @sms_deliveries = SmsDelivery.order(created_at: :desc).paginate(page: params[:page], per_page: 8)

SELECT  "sms_deliveries".* FROM "sms_deliveries" WHERE "sms_deliveries"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @sms_delivery = SmsDelivery.find(params[:id])

SELECT  "sms_deliveries".* FROM "sms_deliveries" WHERE "sms_deliveries"."id" = ? LIMIT 1  [["id", 1]]
---
  def resend_message
    @sms_delivery = SmsDelivery.find(params[:id])

SELECT  "contact_lists".* FROM "contact_lists" WHERE "contact_lists"."id" = ? LIMIT 1  [["id", 2]]
---
  def new_from_contact_list
    @sms_delivery = SmsDelivery.new
    @contact_list = ContactList.find(params[:id])

INSERT INTO "sms_deliveries" ("title", "content", "contact_list_id", "sender_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "pls work"], ["content", "pls work"], ["contact_list_id", 2], ["sender_id", 1], ["created_at", "2015-12-26 09:01:23.223365"], ["updated_at", "2015-12-26 09:01:23.223365"]]
---
  def create
    @sms_delivery = SmsDelivery.new(sms_delivery_params)
    if @sms_delivery.save

SELECT  "sms_deliveries".* FROM "sms_deliveries" WHERE "sms_deliveries"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "sms_deliveries" WHERE "sms_deliveries"."id" = ?  [["id", 4]]
---
  def destroy
    @sms_delivery = SmsDelivery.find(params[:id])
    @sms_delivery.destroy

SELECT  "sms_deliveries".* FROM "sms_deliveries" WHERE "sms_deliveries"."id" = ? LIMIT 1  [["id", nil]]
---
  def send_message
    @sms = SmsDelivery.find(params[:id])