app/controllers/sms_service_accounts_controller.rb

  def index
    @sms_service_accounts = SmsServiceAccount.paginate(page: params[:page], per_page: 10)
    @senders = Sender.all
---
SELECT "sms_service_accounts".* FROM "sms_service_accounts"
SELECT "senders".* FROM "senders" WHERE "senders"."sms_service_account_id" = ?  [["sms_service_account_id", 1]]

  def set_sms_service_account
    @sms_service_account = SmsServiceAccount.find(params[:id])
---
SELECT  "sms_service_accounts".* FROM "sms_service_accounts" WHERE "sms_service_accounts"."id" = ? LIMIT 1  [["id", 1]]