app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page], per_page: 10)
---
SELECT  "users".* FROM "users" LIMIT 10 OFFSET 0

  def students
    add_breadcrumb 'Студенты', :students_url

    student = Role.find_by(name: 'Студент')
    @students = student.users.paginate(page: params[:page], per_page: 10)
---
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT 1  [["name", "Студент"]]
SELECT  "users".* FROM "users" INNER JOIN "users_roles" ON "users"."id" = "users_roles"."user_id" WHERE "users_roles"."role_id" = ? LIMIT 10 OFFSET 0  [["role_id", 4]]