app/views/sms_service_accounts/index.html.erb

        <td>
          <% account.senders.each do |sender| %>
---
SELECT "senders".* FROM "senders" WHERE "senders"."sms_service_account_id" = ?  [["sms_service_account_id", 1]]